Dcl-S MyCharArr Char(10) Dim(10);

MyCharArr(1) = 'Test';
MyCharArr(2) = 'Test';
MyCharArr(3) = 'Test';
MyCharArr(5) = 'Test';

Return %Lookup('':MyCharArr);