**FREE

Return MyProc();

Dcl-Proc MyProc;
  Dcl-Pi MyProc Char(10) End-Pi;

  Dcl-S MyLocal Char(10);

  MyLocal = 'Hello';

  Return MyLocal;
End-Proc;