**FREE

Dcl-S MyInt3 Int(3);
Dcl-S MyInt5 Int(5);
Dcl-S MyInt10 Int(10);
Dcl-S MyInt20 Int(20);

MyInt3 = 50;
MyInt5 = 50;
MyInt10 = 50;
MyInt20 = 50;

Return (MyInt3 + MyInt5 + MyInt10 + MyInt20);