**FREE

Dcl-S myint int(3);
dcl-S counter int(3);

myint = 0;
counter = 0;

Dow myint < 10;

  myint += 1;

  if (myint = 5);
    iter;
    //dsply 'iter';
  endif;

  counter += 1;

Enddo;

return counter;