     A          R NEWFMT    
     A                                  9 26'Name:'
     A                                      COLOR(TRQ)
     A            NAME       10      B  9 33COLOR(RED)